lains/stm32-linky-display/src/main.cpp
struct PowerHistory {
    /* Types */
    typedef enum {
        PerSecond = 0,
        Per5Seconds,
        Per10Seconds,
        Per15Seconds,
        Per30Seconds,
        PerMinute,
        AveraginOverMinutesOrMore = PerMinute,
        Per5Minutes,
    } AveragingMode;

    PowerHistory(AveragingMode averagingPeriod) :
        data(),
        averagingPeriod(averagingPeriod),
        lastPowerHorodate()
    {
    }

    void onNewPowerData(const TicEvaluatedPower& power, const TIC::Horodate& horodate) {
        if (!power.isValid || !horodate.isValid) {
            return;
        }
        if (this->horodatesAreInSamePeriodSample(horodate, this->lastPowerHorodate)) {
            PowerHistoryEntry* lastEntry = this->data.getPtrToLast();
            if (lastEntry != nullptr) {
                lastEntry->averageWithPowerSample(power, horodate);
                this->lastPowerHorodate = horodate;
                return;
            }
            /* If lastEntry is not valid, create a new entry by falling-through the following code */
        }
        this->data.push(PowerHistoryEntry(power, horodate)); /* First sample in this period */
        this->lastPowerHorodate = horodate;
    }

    bool horodatesAreInSamePeriodSample(const TIC::Horodate& first, const TIC::Horodate& second) {
        if (first.year != second.year ||
            first.month != second.month ||
            first.day != second.day ||
            first.hour != second.hour)
            return false; /* Period is different whenever anything longer than one hour is different between the two horodates */
        if (this->averagingPeriod >= AveraginOverMinutesOrMore) { /* We are averaging over at least 1 minute, so only compare minutes */
            switch (this->averagingPeriod) {
                case PerMinute:
                    return (first.minute == second.minute); /* Minutes should be equal to be in the same sampling period */
                case Per5Minutes:
                    if (first.minute > second.minute) {
                        return ((first.minute - second.minute) < 5);
                    }
                    else {
                        return ((second.minute - first.minute) < 5);
                    }
                default:    /* Unsupported averaging period */
                    return false;
            }
        }
        /* If we fall here, we are averaging over less than 1 minute */
        if (first.minute != second.minute)
            return false; /* Period is different whenever the minute is different between the two horodates */
        unsigned int maxPeriodDeltaInSeconds = 0;
        switch (this->averagingPeriod) {
            case PerSecond:
                maxPeriodDeltaInSeconds = 1;
                break;
            case Per5Seconds:
                maxPeriodDeltaInSeconds = 5;
                break;
            case Per10Seconds:
                maxPeriodDeltaInSeconds = 10;
                break;
            case Per15Seconds:
                maxPeriodDeltaInSeconds = 15;
                break;
            case Per30Seconds:
                maxPeriodDeltaInSeconds = 30;
                break;
            default:    /* All other possible periods are over one minute, they have been handled above, this block should never be reached */
                return false;
        }
        unsigned int delta;
        if (first.second > second.second) {
            delta = first.second - second.second;
        }
        else {
            delta = second.second - first.second;
        }
        return (delta < maxPeriodDeltaInSeconds);
    }

    /**
     * @brief Utility function to unwrap a TicFrameParser instance and invoke onDatasetExtracted() on it
     * It is used as a callback provided to TIC::DatasetExtractor
     * 
     * @param context A context as provided by TIC::DatasetExtractor, used to retrieve the wrapped TicFrameParser instance
     */
    static void unWrapOnNewPowerData(const TicEvaluatedPower& power, const TIC::Horodate& horodate, void* context) {
        if (context == nullptr)
            return; /* Failsafe, discard if no context */
        PowerHistory* powerHistoryInstance = static_cast<PowerHistory*>(context);
        /* We have finished parsing a frame, if there is an open dataset, we should discard it and start over at the following frame */
        powerHistoryInstance->onNewPowerData(power, horodate);
    }

    /**
     * @brief Get the Last Values object
     * 
     * @param[in,out] nb The max number of measurements requested, modified at return to represent the number of measurements actually retrieved
     * @param[out] result A C-array of results, the first one being the most recent
     * 
     * @note The horodate of the most recent entry can be retrieved in the first element of the result array (if nb!=0 at return)
     */
    void getLastPower(unsigned int& nb, PowerHistoryEntry* result) {
        if (nb > this->data.getCount())
            nb = this->data.getCount();   /* Saturate to the number of actual values we hold */
        for (unsigned int reversePos = 0; reversePos < nb; reversePos++) {
            result[reversePos] = this->data.getReverse(reversePos);
        }
    }

/* Attributes */
    FixedSizeRingBuffer<PowerHistoryEntry, 1024> data;    /*!< The last n instantaneous power measurements */
    AveragingMode averagingPeriod; /*!< Which sampling period do we record (we will perform an average on all samples within the period) */
    TIC::Horodate lastPowerHorodate;    /*!< The horodate of the last received power measurement */
};

void drawHistory(uint16_t x, uint16_t y, uint16_t width, uint16_t height, const PowerHistory& history) {
    #warning use getLastPower, for each entry, if we have a range and the high boundary is positive, what do we display?
}

/**
 * @brief  Main program
 */
int main(void) {
    /* STM32F4xx HAL library initialization:
      - Configure the Flash prefetch, instruction and Data caches
      - Systick timer is configured by default as source of time base, but user 
        can eventually implement his proper time base source (a general purpose 
        timer for example or other time source), keeping in mind that Time base 
        duration should be kept 1ms since PPP_TIMEOUT_VALUEs are defined and 
        handled in milliseconds basis.
      - Set NVIC Group Priority to 4
      - Low Level Initialization: global MSP (MCU Support Package) initialization
    */
    HAL_Init();
  
    /* Configure the system clock to 180 MHz */
    SystemClock_Config();

    /* Configure LED1, LED2, LED3 and LED4 */
    BSP_LED_Init(LED1);
    BSP_LED_Init(LED2);
    BSP_LED_Init(LED3);
    BSP_LED_Init(LED4);
    BSP_LED_On(LED2);
    waitDelay(250);
    BSP_LED_Off(LED2);

